# Z Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
XYZ..::..Z Property
XYZ Class See Also
---
Gets the third coordinate.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Z { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Z As Double
	Get
```

Visual C++
---
```text
public:
property double Z {
	double get ();
}
```

# See Also
XYZ Class
Autodesk.Revit.DB Namespace